# Pandas

data manipulation package that makes use of Numpy, uses mainly Series and Dataframes

In [3]:
import numpy as np
import pandas as pd

### Series

one dimensional arrays with axis labels (index)

In [4]:
# Series from list
x= pd.Series([10,20,30,40,50])
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
# Accessing index
x.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
#accessing dtype, Series are ndarrays so they are homogeneous, only store one data type
x.dtype

dtype('int64')

In [7]:
# Series with index
data = [450,650,870]
Sales = pd.Series(data,index = ["Don","Mike","Edwin"])
Sales

Don      450
Mike     650
Edwin    870
dtype: int64

In [8]:
type(Sales)

pandas.core.series.Series

In [9]:
Sales.index

Index(['Don', 'Mike', 'Edwin'], dtype='object')

In [10]:
Sales["Don"]

450

In [11]:
Sales[0]

C:\Users\liamd\AppData\Local\Temp\ipykernel_14740\925086647.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  Sales[0]

450

### Checking for conditions

In [12]:
Sales>500

Don      False
Mike      True
Edwin     True
dtype: bool

In [13]:
Sales[[False,True,True]]

Mike     650
Edwin    870
dtype: int64

In [14]:
Sales[Sales>500]

Mike     650
Edwin    870
dtype: int64

In [15]:
"Don" in Sales

True

In [16]:
"Liam" in Sales

False

In [17]:
450 in Sales

False

### Working with Dicts

In [18]:
#Series to dict
salesDict = Sales.to_dict()
salesDict

{'Don': 450, 'Mike': 650, 'Edwin': 870}

In [19]:
#Dict to Series

In [20]:
salesSer = Series(salesDict)
salesSer

NameError: name 'Series' is not defined

### Addomg entries and working with with MaM

In [21]:
#new series from existing
newSales = Series(Sales, index = ["Don", "Mike", "Edwin","Liam","Ryan"])
newSales

NameError: name 'Series' is not defined

In [22]:
#Checking NaN values
np.isnan(newSales)

NameError: name 'newSales' is not defined

In [23]:
#Check for null values
pd.isnull(newSales)

NameError: name 'newSales' is not defined

### Naming components

In [24]:
Sales.index.name = "Sales person"
Sales

Sales person
Don      450
Mike     650
Edwin    870
dtype: int64

In [25]:
Sales.name = "Total tv sales"
Sales

Sales person
Don      450
Mike     650
Edwin    870
Name: Total tv sales, dtype: int64

## DataFrames

DataFrames are two-dimensional, size-mutable, potentially heterogeneous tabular data structures

In [26]:
# Creating a DF from a list
data = [["Adrian",20], ["Bethany", 23], ["Chloe", 41]]

#can specify what column names and data types on creation
df = pd.DataFrame(data, columns = ["Name", "Age"])
df

      Name  Age
0   Adrian   20
1  Bethany   23
2    Chloe   41

In [27]:
## DF from dict
dict1 = {'Name': ["Adrian","Bethany","Chloe"],
         'Age': [20,23,41]}
df = pd.DataFrame(dict1)
df

      Name  Age
0   Adrian   20
1  Bethany   23
2    Chloe   41

In [28]:
# Adding custom indexes
df = df.set_index(pd.Index(['A','B','C']))
df

      Name  Age
A   Adrian   20
B  Bethany   23
C    Chloe   41

In [29]:
# DF from list of dicts
df = pd.DataFrame( [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'Los Angeles'},
    {'Name': 'Charlie', 'Age': 35, 'City': 'Chicago'}
])
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [30]:
#Df from Series
df = pd.DataFrame(newSales)
df

NameError: name 'newSales' is not defined

In [31]:
Sales2 = pd.Series([2000,3000,5000,0,0],index = ["Don","Mike","Edwin","Liam","Ryan"])
Sales2

Don      2000
Mike     3000
Edwin    5000
Liam        0
Ryan        0
dtype: int64

In [32]:
df = pd.DataFrame(Sales)
df

              Total tv sales
Sales person
Don                      450
Mike                     650
Edwin                    870

In [33]:
df = pd.concat([df, Sales2.to_frame().T])
df

       Total tv sales     Don    Mike   Edwin  Liam  Ryan
Don             450.0     NaN     NaN     NaN   NaN   NaN
Mike            650.0     NaN     NaN     NaN   NaN   NaN
Edwin           870.0     NaN     NaN     NaN   NaN   NaN
0                 NaN  2000.0  3000.0  5000.0   0.0   0.0

### Interacting with index

In [34]:
#Shifting index
df= df.shift(1)
df

       Total tv sales  Don  Mike  Edwin  Liam  Ryan
Don               NaN  NaN   NaN    NaN   NaN   NaN
Mike            450.0  NaN   NaN    NaN   NaN   NaN
Edwin           650.0  NaN   NaN    NaN   NaN   NaN
0               870.0  NaN   NaN    NaN   NaN   NaN

In [35]:
#changing index
df = df.set_index("Total tv sales")
df

                Don  Mike  Edwin  Liam  Ryan
Total tv sales
NaN             NaN   NaN    NaN   NaN   NaN
450.0           NaN   NaN    NaN   NaN   NaN
650.0           NaN   NaN    NaN   NaN   NaN
870.0           NaN   NaN    NaN   NaN   NaN

### Fill methods

In [36]:
# Filling missing values
df = df.fillna("filled")
df

                   Don    Mike   Edwin    Liam    Ryan
Total tv sales
NaN             filled  filled  filled  filled  filled
450.0           filled  filled  filled  filled  filled
650.0           filled  filled  filled  filled  filled
870.0           filled  filled  filled  filled  filled

can fill missing values by propagating the next valid observation with the direction depending on the command

In [37]:

# bfill for back
dfstart = pd.DataFrame({
    'A': [1, np.nan, 3, np.nan, 5],
    'B': [np.nan, 2, np.nan, 4, np.nan]
})
dfstart

     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  NaN
3  NaN  4.0
4  5.0  NaN

In [38]:
df = dfstart.bfill()
df

     A    B
0  1.0  2.0
1  3.0  2.0
2  3.0  4.0
3  5.0  4.0
4  5.0  NaN

In [39]:
#ffill for forward
df = dfstart.ffill()
df

     A    B
0  1.0  NaN
1  1.0  2.0
2  3.0  2.0
3  3.0  4.0
4  5.0  4.0

In [40]:
#pad another way of doing ffill
df = dfstart.pad()
df

C:\Users\liamd\AppData\Local\Temp\ipykernel_14740\121195380.py:2: FutureWarning: DataFrame.pad/Series.pad is deprecated. Use DataFrame.ffill/Series.ffill instead
  df = dfstart.pad()

     A    B
0  1.0  NaN
1  1.0  2.0
2  3.0  2.0
3  3.0  4.0
4  5.0  4.0

In [41]:
# interpolate fills based on input method
dfnew = dfstart.interpolate('linear')

### Dropping parts of DataFrame

In [42]:
#drop row by index
df = dfnew.drop(0)
df

     A    B
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0
4  5.0  4.0

In [43]:
#drop column
df = dfnew.drop("A",axis=1)
df

     B
0  NaN
1  2.0
2  3.0
3  4.0
4  4.0

In [44]:
#Drop based on a threshold
df= dfnew[dfnew["B"]>=3]
df

     A    B
2  3.0  3.0
3  4.0  4.0
4  5.0  4.0

In [45]:
#Drop based on an index
df = dfnew.drop([dfnew.index[1]])
df

     A    B
0  1.0  NaN
2  3.0  3.0
3  4.0  4.0
4  5.0  4.0

In [46]:
#Remove duplicate rows
data = {
    "Name": ["Alice", "Bob", "Alice", "David"],
    "Age": [25, 30, 25, 40],
    "City": ["NY", "LA", "NY", "Chicago"]
}
df = pd.DataFrame(data)
display(df)
df = df.drop_duplicates()
display(df)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [47]:
#Find duplicate rows
df = pd.DataFrame(data)
display(df)
df= df[df.duplicated()]
display(df)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago

    Name  Age City
2  Alice   25   NY

### Selecting parts of DataFrame

In [48]:
#select an entire column
df = pd.DataFrame(data)
display(df)
display(df["Name"])

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago

0    Alice
1      Bob
2    Alice
3    David
Name: Name, dtype: object

Loc gets rows with/columns particular labels and iloc gets rows/columns at integer locations

In [49]:
df.loc[1]

Name    Bob
Age      30
City     LA
Name: 1, dtype: object

In [51]:
df.iloc[1:3]

    Name  Age City
1    Bob   30   LA
2  Alice   25   NY

In [104]:
#filtering df
display(df[df["Age"] >=30])

    Name  Age     City
1    Bob   30       LA
3  David   40  Chicago

In [105]:
#sorting by columns values
df.sort_values("Age")

    Name  Age     City
0  Alice   25       NY
2  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

The rank() function is used to compute numerical data ranks (1 through n) along axis.

By default, equal values are assigned a rank that is the average of the ranks of those values.

In [107]:
#Ranking
df["Age"].rank()

0    1.5
1    3.0
2    1.5
3    4.0
Name: Age, dtype: float64

The describe() method returns description of the data in the DataFrame.

If the DataFrame contains numerical data, the description contains these information for each column:

count - The number of not-empty values.
mean - The average (mean) value.
std - The standard deviation.
min - the minimum value.
25% - The 25% percentile*.
50% - The 50% percentile*.
75% - The 75% percentile*.
max - the maximum value.

In [108]:
df.describe()

             Age
count   4.000000
mean   30.000000
std     7.071068
min    25.000000
25%    25.000000
50%    27.500000
75%    32.500000
max    40.000000

Pandas offers individual functions like mean() , median() , std() , var() , min() , max() , quantile() , and sum() which can be applied to columns or rows of a DataFrame.

In [111]:
df["Age"].mean()

30.0

In [115]:
# Hierarchical Indexing or multi-indexing useful for when the index no longer uniquely specifies a row
data = {
    "date": ["2017-01-01", "2017-01-02", "2017-01-03", "2017-01-01", "2017-01-02", "2017-01-03"],
    "language": ["python", "python", "python", "r", "r", "r"],
    "ex_complete": [6, 5, 10, 8, 8, 8]
}

df = pd.DataFrame(data)
df.set_index(['date', 'language'], inplace=True)
display(df)
df.index

                     ex_complete
date       language
2017-01-01 python              6
2017-01-02 python              5
2017-01-03 python             10
2017-01-01 r                   8
2017-01-02 r                   8
2017-01-03 r                   8

MultiIndex([('2017-01-01', 'python'),
            ('2017-01-02', 'python'),
            ('2017-01-03', 'python'),
            ('2017-01-01',      'r'),
            ('2017-01-02',      'r'),
            ('2017-01-03',      'r')],
           names=['date', 'language'])